---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Description
source: html/3e4aa957-c27a-5f87-5436-2bfd35f77e21.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.Description Property

The description of the construction.

## Syntax (C#)
```csharp
public string Description { get; }
```